FIOLOG/nvme0n1_220606_144600_fio.log
/dev/nvme0n1: (g=0): rw=rw, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=32
fio-3.28
Starting 1 process

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=827441: Mon Jun  6 14:47:00 2022
  write: IOPS=5975, BW=747MiB/s (783MB/s)(43.8GiB/60004msec); 0 zone resets
    slat (usec): min=6, max=565, avg=42.66, stdev=15.10
    clat (usec): min=483, max=69137, avg=5310.34, stdev=6848.88
     lat (usec): min=508, max=69195, avg=5353.31, stdev=6851.82
    clat percentiles (usec):
     |  1.00th=[ 2933],  5.00th=[ 3064], 10.00th=[ 3163], 20.00th=[ 3326],
     | 30.00th=[ 3425], 40.00th=[ 3556], 50.00th=[ 3621], 60.00th=[ 3720],
     | 70.00th=[ 3818], 80.00th=[ 3949], 90.00th=[ 4359], 95.00th=[20579],
     | 99.00th=[47973], 99.50th=[50070], 99.90th=[52167], 99.95th=[53216],
     | 99.99th=[65274]
   bw (  KiB/s): min=98304, max=1189120, per=100.00%, avg=769298.37, stdev=454958.36, samples=119
   iops        : min=  768, max= 9290, avg=6010.09, stdev=3554.47, samples=119
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=81.82%, 10=11.18%, 20=1.76%, 50=4.77%
  lat (msec)   : 100=0.46%
  cpu          : usr=9.06%, sys=23.92%, ctx=157642, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,358528,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=747MiB/s (783MB/s), 747MiB/s-747MiB/s (783MB/s-783MB/s), io=43.8GiB (47.0GB), run=60004-60004msec

Disk stats (read/write):
  nvme0n1: ios=50/357930, merge=0/0, ticks=4/1885002, in_queue=1885004, util=99.96%