FIOLOG/nvme0n1_220606_145323_fio.log
/dev/nvme0n1: (g=0): rw=randwrite, bs=(R) 512B-64.0KiB, (W) 512B-64.0KiB, (T) 512B-64.0KiB, ioengine=libaio, iodepth=16
...
fio-3.28
Starting 2 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1622518: Mon Jun  6 14:53:43 2022
  write: IOPS=5705, BW=42.5MiB/s (44.6MB/s)(852MiB/20020msec); 0 zone resets
    slat (usec): min=2, max=154, avg=12.43, stdev= 7.56
    clat (usec): min=83, max=36236, avg=2789.20, stdev=6698.80
     lat (usec): min=87, max=36244, avg=2801.87, stdev=6698.88
    clat percentiles (usec):
     |  1.00th=[  196],  5.00th=[  223], 10.00th=[  241], 20.00th=[  260],
     | 30.00th=[  273], 40.00th=[  289], 50.00th=[  318], 60.00th=[  478],
     | 70.00th=[  824], 80.00th=[ 1172], 90.00th=[19792], 95.00th=[22414],
     | 99.00th=[24249], 99.50th=[24511], 99.90th=[26346], 99.95th=[34866],
     | 99.99th=[35914]
   bw (  KiB/s): min=39108, max=48992, per=50.09%, avg=43573.18, stdev=2195.00, samples=39
   iops        : min= 5044, max= 6400, avg=5706.77, stdev=245.92, samples=39
  lat (usec)   : 100=0.02%, 250=13.82%, 500=47.17%, 750=6.81%, 1000=7.62%
  lat (msec)   : 2=13.34%, 4=0.95%, 10=0.06%, 20=0.24%, 50=9.97%
  cpu          : usr=4.93%, sys=7.04%, ctx=7132, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,114216,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1622519: Mon Jun  6 14:53:43 2022
  write: IOPS=5701, BW=42.4MiB/s (44.5MB/s)(849MiB/20020msec); 0 zone resets
    slat (usec): min=2, max=107, avg=12.44, stdev= 7.61
    clat (usec): min=83, max=36671, avg=2791.11, stdev=6700.99
     lat (usec): min=86, max=36689, avg=2803.79, stdev=6701.06
    clat percentiles (usec):
     |  1.00th=[  196],  5.00th=[  223], 10.00th=[  241], 20.00th=[  260],
     | 30.00th=[  273], 40.00th=[  289], 50.00th=[  318], 60.00th=[  478],
     | 70.00th=[  824], 80.00th=[ 1172], 90.00th=[19792], 95.00th=[22414],
     | 99.00th=[24249], 99.50th=[24511], 99.90th=[26346], 99.95th=[34866],
     | 99.99th=[35914]
   bw (  KiB/s): min=36990, max=48969, per=49.97%, avg=43467.92, stdev=2044.84, samples=39
   iops        : min= 5022, max= 6310, avg=5703.51, stdev=239.75, samples=39
  lat (usec)   : 100=0.02%, 250=13.70%, 500=47.39%, 750=6.75%, 1000=7.57%
  lat (msec)   : 2=13.36%, 4=0.94%, 10=0.06%, 20=0.25%, 50=9.97%
  cpu          : usr=4.55%, sys=7.43%, ctx=7118, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,114138,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=85.0MiB/s (89.1MB/s), 42.4MiB/s-42.5MiB/s (44.5MB/s-44.6MB/s), io=1701MiB (1783MB), run=20020-20020msec

Disk stats (read/write):
  nvme0n1: ios=51/227055, merge=0/0, ticks=25/598023, in_queue=598047, util=99.81%