FIOLOG/nvme0n1_220606_145607_fio.log
/dev/nvme0n1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 4 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1628852: Mon Jun  6 14:56:17 2022
  read: IOPS=40.4k, BW=158MiB/s (166MB/s)(1580MiB/10002msec)
    slat (nsec): min=1937, max=72832, avg=3564.28, stdev=2518.21
    clat (usec): min=550, max=3018, avg=1578.44, stdev=19.03
     lat (usec): min=575, max=3021, avg=1582.07, stdev=18.88
    clat percentiles (usec):
     |  1.00th=[ 1549],  5.00th=[ 1565], 10.00th=[ 1565], 20.00th=[ 1582],
     | 30.00th=[ 1582], 40.00th=[ 1582], 50.00th=[ 1582], 60.00th=[ 1582],
     | 70.00th=[ 1582], 80.00th=[ 1582], 90.00th=[ 1582], 95.00th=[ 1598],
     | 99.00th=[ 1614], 99.50th=[ 1631], 99.90th=[ 1680], 99.95th=[ 1713],
     | 99.99th=[ 2376]
   bw (  KiB/s): min=161040, max=162168, per=25.01%, avg=161785.68, stdev=245.41, samples=19
   iops        : min=40260, max=40542, avg=40446.42, stdev=61.35, samples=19
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=99.97%, 4=0.02%
  cpu          : usr=10.29%, sys=16.87%, ctx=219496, majf=0, minf=75
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=404368,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1628853: Mon Jun  6 14:56:17 2022
  read: IOPS=40.4k, BW=158MiB/s (166MB/s)(1580MiB/10002msec)
    slat (nsec): min=1922, max=55968, avg=3543.89, stdev=2512.01
    clat (usec): min=452, max=3086, avg=1578.25, stdev=18.95
     lat (usec): min=465, max=3089, avg=1581.85, stdev=18.78
    clat percentiles (usec):
     |  1.00th=[ 1532],  5.00th=[ 1565], 10.00th=[ 1565], 20.00th=[ 1582],
     | 30.00th=[ 1582], 40.00th=[ 1582], 50.00th=[ 1582], 60.00th=[ 1582],
     | 70.00th=[ 1582], 80.00th=[ 1582], 90.00th=[ 1582], 95.00th=[ 1598],
     | 99.00th=[ 1631], 99.50th=[ 1631], 99.90th=[ 1680], 99.95th=[ 1696],
     | 99.99th=[ 1942]
   bw (  KiB/s): min=160960, max=162160, per=25.01%, avg=161805.89, stdev=227.78, samples=19
   iops        : min=40240, max=40540, avg=40451.47, stdev=56.94, samples=19
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=99.98%, 4=0.01%
  cpu          : usr=9.91%, sys=17.53%, ctx=228374, majf=0, minf=79
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=404424,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1628854: Mon Jun  6 14:56:17 2022
  read: IOPS=40.4k, BW=158MiB/s (166MB/s)(1580MiB/10002msec)
    slat (nsec): min=1911, max=55824, avg=3568.96, stdev=2547.71
    clat (usec): min=446, max=3128, avg=1578.14, stdev=22.62
     lat (usec): min=459, max=3132, avg=1581.76, stdev=22.47
    clat percentiles (usec):
     |  1.00th=[ 1532],  5.00th=[ 1565], 10.00th=[ 1565], 20.00th=[ 1582],
     | 30.00th=[ 1582], 40.00th=[ 1582], 50.00th=[ 1582], 60.00th=[ 1582],
     | 70.00th=[ 1582], 80.00th=[ 1582], 90.00th=[ 1582], 95.00th=[ 1598],
     | 99.00th=[ 1614], 99.50th=[ 1631], 99.90th=[ 1680], 99.95th=[ 1713],
     | 99.99th=[ 2737]
   bw (  KiB/s): min=160720, max=162656, per=25.02%, avg=161824.84, stdev=332.93, samples=19
   iops        : min=40180, max=40664, avg=40456.21, stdev=83.23, samples=19
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=99.97%, 4=0.02%
  cpu          : usr=9.04%, sys=18.32%, ctx=226862, majf=0, minf=77
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=404448,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=1628855: Mon Jun  6 14:56:17 2022
  read: IOPS=40.4k, BW=158MiB/s (166MB/s)(1579MiB/10002msec)
    slat (nsec): min=1907, max=82586, avg=3549.80, stdev=2489.24
    clat (usec): min=448, max=3141, avg=1578.60, stdev=18.50
     lat (usec): min=462, max=3144, avg=1582.22, stdev=18.35
    clat percentiles (usec):
     |  1.00th=[ 1549],  5.00th=[ 1565], 10.00th=[ 1565], 20.00th=[ 1582],
     | 30.00th=[ 1582], 40.00th=[ 1582], 50.00th=[ 1582], 60.00th=[ 1582],
     | 70.00th=[ 1582], 80.00th=[ 1582], 90.00th=[ 1598], 95.00th=[ 1598],
     | 99.00th=[ 1631], 99.50th=[ 1631], 99.90th=[ 1696], 99.95th=[ 1713],
     | 99.99th=[ 2057]
   bw (  KiB/s): min=161064, max=162048, per=25.01%, avg=161762.11, stdev=210.21, samples=19
   iops        : min=40266, max=40512, avg=40440.53, stdev=52.55, samples=19
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=99.98%, 4=0.01%
  cpu          : usr=8.95%, sys=18.04%, ctx=215367, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=404331,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=632MiB/s (662MB/s), 158MiB/s-158MiB/s (166MB/s-166MB/s), io=6319MiB (6626MB), run=10002-10002msec

Disk stats (read/write):
  nvme0n1: ios=1600643/0, merge=0/0, ticks=2520532/0, in_queue=2520532, util=99.05%